OdDAI.EnumerationType.getSpecifiedValueType
\details
Provides a specified enum type with valid EnumerationType.
\returns Returns specified enum type with valid EnumerationType.

OdDAI.EnumerationType.StringToValueCaseInsensitive(OdAnsiString)
\details
converts caseinsensitive string enum value to int
\param testValue [in] value to convert
\returns Returns an int value of string caseinsensitive enum. If the string value was not found, the function should return unset int value.

OdDAI.EnumerationType.StringToValue(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
converts string enum value to int
\param testValue [in] value to convert
\returns Returns an int value of string enum. If the string value is not at the enum, the function should return unset value.

OdDAI.EnumerationType.ValueToString(System.Int32)
\details
converts int value to string
\param testValue [in] value to convert
\returns Returns a text of int value. If int value is not valid value, function should return an empty string.

OdDAI.EnumerationType.isValid(System.Int32)
\details
validate enumeration value
\param testValue [in] value to test
\returns Returns true if the value is valid and false otherwise.

OdDAI.EnumerationType.getUnset
\details
Return the unset value for enumeration type.
\returns Returns the unset value for enumeration type..

OdDAI.EnumerationType.elements
\details
Retreives a list of values of enumeration type.
\returns Returns a list of values of enumeration type.

OdDAI.EnumerationType.type
\details
Retreives a type code of enumeration type.
\returns Returns a smart pointer to type code of enumeration type.

OdDAI.EnumerationType.#ctor(OdSharedPtr&lt;OdTypeCode&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdArray&lt;OdAnsiString,OdObjectsAllocator&lt;OdAnsiString&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Creates a new enumeration type object with specified parameters.
\param typeCode [in] A smart pointer to a type code of enumeration type.
\param elements [in] A list of values of enumeration type.

OdDAI.EnumerationType.Dispose
\details
Destroys the dummy object.

OdDAI.EnumerationType.#ctor
\details
Creates a new enumeration type object with default parameters.

OdDAI.EnumerationType
\details
A class that implements the storing of enumeration types.